<a href="https://colab.research.google.com/github/Gauri15-code/python_class/blob/main/Worksheet_6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
print(pd.__version__)

data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35], 'City': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print(df)

S1 = pd.Series([100, 200, 300, 400, 500])
print(S1)
print(S1[1], S1[3])

S2 = pd.Series([10, 20, 30, 40, 50])
print(S1 + S2)

print(df[['Name', 'City']])

df['Salary'] = [50000, 60000, 70000]
print(df)

print(df['Age'].mean())
print(df['Salary'].sum())

print(df[df['Age'] > 28])

df = df.set_index('Name')
print(df)

df = df.reset_index()
print(df)

import pandas as pd

employees = pd.DataFrame({
    'Name': ['John', 'Jane', 'Emily'],
    'Department': ['Sales', 'Marketing', 'HR'],
    'Salary': [50000, 60000, 55000]
})

print(employees)

filtered = employees[employees['Salary'] > 55000]
print(filtered[['Name', 'Department']])

grouped = employees.groupby('Department')['Salary'].mean()
print(grouped)

agg_result = employees.groupby('Department')['Salary'].agg(['min', 'max'])
print(agg_result)

df1 = pd.DataFrame({
    'Name': ['John', 'Jane', 'Emily'],
    'Department': ['Sales', 'Marketing', 'HR']
})
df2 = pd.DataFrame({
    'Name': ['John', 'Jane', 'Emily'],
    'Experience (Years)': [5, 7, 3]
})
merged = pd.merge(df1, df2, on='Name')
print(merged)

sorted_df = merged.sort_values(by='Experience (Years)', ascending=False)
print(sorted_df)

2.2.2
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
0    100
1    200
2    300
3    400
4    500
dtype: int64
200 400
0    110
1    220
2    330
3    440
4    550
dtype: int64
      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000
30.0
180000
      Name  Age         City  Salary
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000
         Age         City  Salary
Name
Alice     25     New York   50000
Bob       30  Los Angeles   60000
Charlie   35      Chicago   70000
      Name  Age         City  Salary
0    Alice   25     New York   50000
1      Bob   30  Los Angeles   60000
2  Charlie   35      Chicago   70000
    Name Department  Salary
0   John      Sales   50000
1   Jane  Marketing   60000
2  Emily         HR   55000
   Name Department
1  Jane  Marketing
Department
HR           55000.0
Marketing    60000.0
Sales        50000.0
Name: Salary, dtype: float64
              min    max
Department
HR          55000  55000
Marketing   60000  60000
Sales       50000  50000
    Name Department  Experience (Years)
0   John      Sales                   5
1   Jane  Marketing                   7
2  Emily         HR                   3
    Name Department  Experience (Years)
1   Jane  Marketing                   7
0   John      Sales                   5
2  Emily         HR                   3